// ignore_for_file: unused_import

import 'package:work3/models/activity_model.dart';

class Destination {
  String imageUrl;
  String city;
  String country;
  String description;
  String info;
  String imginfo;
  String imginfo2;
  String imginfo3;

  Destination({
    required this.imageUrl,
    required this.city,
    required this.country,
    required this.description,
    required this.info,
    required this.imginfo,
    required this.imginfo2,
    required this.imginfo3,
  });
}

List<Destination> destinations = [
  Destination(
      imageUrl: 'assets/images/1.jpg',
      city: 'ช้าง อารีน่า',
      country: 'เมือง',
      description:
          'ชื่อเดิม ไอ-โมบาย สเตเดียม ตั้งอยู่ที่อำเภอเมือง สนามแห่งมีความจุ 32,600 ที่นั่ง',
      info:
          '        สนามนี้มีทั้งหมด 4 ชั้น โดยชั้นที่ 1 เป็นสำนักงานห้องแถลงข่าว ห้องสื่อมวลชน ร้านขายสินค้าที่ระลึก ห้องนักกีฬาทีมเหย้า-เยือน ห้องพักผู้ตัดสิน ห้องปฐมพยาบาล และห้องประชุม ชั้นที่ 2 จะเป็นห้องจัดเลี้ยงใหญ่จำนวน 400 ที่นั่ง ชั้นที่ 3 เป็นห้องวีไอพี 6 ห้อง และห้องจัดเลี้ยง 1 ห้อง และชั้นที่ 4 มีห้องวีไอพีจำนวน 15 ห้อง สนามแห่งนี้ยังมีการติดตั้งไฟส่องสว่างตามมาตรฐาน ของฟิลิปส์โดยมีค่าความสว่างของไฟอยู่ที่ 1,500 ลักซ์ ในส่วนอัฒจันทร์ฝั่งกองเชียร์นั้นมีเก้าอี้ที่นั่งเชียร์เป็นสีน้ำเงินเกือบหมด แต่จะใช้เก้าอี้สีขาวตรงที่มีคำว่า ธันเดอร์คาสเซิล และ บุรีรัมย์ มีหัวหน้ากองเชียร์คือ นางกรุณา ชิดชอบ เป็นแกนนำหลักในการเชียร์ ช้างอารีนา เคยใช้เป็นสถานที่จัดคอนเสิร์ตและกิจกรรมรื่นเริงครั้งใหญ่ในเทศกาลสงกรานต์ในปี พ.ศ. 2555 โดยการจัดของนายเนวิน ชิดชอบ ประธานสโมสร โดยมีศิลปินนักร้องมากมาย อาทิ โซระ อาโออิ, เอ็นเอส ยุน จี, ปีเตอร์ คอร์ป ไดเรนดัล, นูโว, ไมโคร, ปกรณ์ ลัม, บอดี้สแลม, คาราบาว, ลาบานูน, บิ๊กแอส, โลโซ เป็นต้นปลายปี พ.ศ. 2560 เมื่อกลุ่มสามารถคอร์ปอเรชั่น ได้ยุติตราสินค้าไอ-โมบาย ชื่อสนามจึงได้เปลี่ยนตามผู้สนับสนุนหลักของสโมสรอีกบริษัทหนึ่ง คือ ช้าง โดย บริษัท ไทยเบฟเวอเรจ จำกัด (มหาชน) ซึ่งสนามแข่งรถที่อยู่ในบริเวณใกล้เคียง ก็ใช้ชื่อตามตราสินค้านี้เช่นกัน',
      imginfo: 'assets/images/1-1.jpg',
      imginfo2: 'assets/images/1-2.jpg',
      imginfo3: 'assets/images/1-3.jpg'),
  Destination(
    imageUrl: 'assets/images/2.jpg',
    city: 'ปราสาทเขาพนมรุ้ง',
    country: 'เฉลิมพระเกียรติ',
    description: 'ห่างจากตัวเมืองบุรีรัมย์ลงมาทางทิศใต้ประมาณ 77 กิโลเมตร',
    info:
        'อุทยานประวัติศาสตร์พนมรุ้ง หรือ ปราสาทหินพนมรุ้ง เป็นหนึ่งในปราสาทหินในกลุ่มราชมรรคา ตั้งอยู่ที่หมู่ที่ 2 บ้านดอนหนองแหน) ตำบลตาเป๊ก อำเภอเฉลิมพระเกียรติ ห่างจากตัวเมืองบุรีรัมย์ลงมาทางทิศใต้ประมาณ 77 กิโลเมตร ประกอบไปด้วยโบราณสถานสำคัญ ซึ่งตั้งอยู่บนยอดภูเขาไฟที่ดับสนิทแล้ว สูงประมาณ 200 เมตรจากพื้นราบ ประมาณ 350 เมตรจากระดับน้ำทะเลปานกลาง คำว่า พนมรุ้ง นั้น มาจากภาษาเขมร คำว่า วนํรุง แปลว่า ภูเขาใหญ่ปัจจุบัน ปราสาทหินพนมรุ้งกำลังอยู่ในเกณฑ์กำลังพิจารณาเป็นมรดกโลก เช่นเดียวกับ ปราสาทหินในกลุ่มราชมรรคา ปราสาทหินพนมรุ้งเป็นหนึ่งในปราสาทหินขอมของไทยที่มีชื่อเสียงมากที่สุด เป็นสถานที่ท่องเที่ยวที่สำคัญที่สุดแห่งหนึ่งของจังหวัดบุรีรัมย์ และถือเป็นสัญลักษณ์ที่สำคัญของจังหวัดบุรีรัมย์ รวมถึงเป็นภาพพื้นหลังตราสัญลักษณ์ของสโมสรฟุตบอลบุรีรัมย์ ยูไนเต็ดอีกด้วย',
    imginfo: 'assets/images/2-1.jpg',
    imginfo2: 'assets/images/2-2.jpg',
    imginfo3: 'assets/images/2-3.jpg',
  ),
  Destination(
    imageUrl: 'assets/images/3.jpg',
    city: 'ปราสาทเมืองต่ำ',
    country: 'ประโคนชัย',
    description:
        'เป็นศาสนสถานที่ทางศาสนาฮินดู สันนิษฐานว่าสร้างขึ้น เพื่อถวายพระศิวะ ',
    info:
        'ปราสาทเมืองต่ำ หรือ ปราสาทหินเมืองต่ำ เป็นสถานที่ท่องเที่ยวอีกแห่งที่สำคัญ และสวยงามไม่น้อยไปกว่าปราสาทหินพนมรุ้ง ที่นี่เป็นศาสนสถานในศาสนาฮินดู มีสถาปัตยกรรมแบบศิลปะขอมโบราณ และสันนิษฐานว่าสร้างขึ้นในพุทธศตวรรษที่ 16-17 ภายในบริเวณปราสาทเมืองต่ำ มีภาพจำหลักหินบนหน้าบัน และทับหลังที่สวยงามมาก เหมาะแก่การศึกษาด้านประวัติศาสตร์ และศิลปะสมัยขอมโบราณ มีจุดให้ถ่ายรูปสวยๆ หลายจุดภายในบริเวณปราสาท ลักษณะสถาปัตยกรรมด้านในของปราสาทเมืองต่ำนั้นได้รับการก่อสร้างด้วยฝีมือช่างในระดับช่างหลวง เรียกได้ว่าเป็นโบราณสถานที่สวยงามมาก',
    imginfo: 'assets/images/3-1.jpg',
    imginfo2: 'assets/images/3-2.jfif',
    imginfo3: 'assets/images/3-3.jpg',
  ),
  Destination(
    imageUrl: 'assets/images/4.jpg',
    city: 'วนอุทยานภูเขาไฟกระโดง',
    country: 'เมือง',
    description: 'เป็นภูเขาไฟที่ดับสนิทแล้วมีปากปล่องทะลุเห็นได้ชัดเจน',
    info:
        'วนอุทยานภูเขาไฟกระโดง เป็นภูเขาไฟที่ดับสนิทแล้ว มีปากปล่องทะลุเห็นได้ชัดเจน จึงกลายเป็นแหล่งท่องเที่ยว และที่ศึกษาประวัติศาสตร์ ธรณีวิทยาและชีววิทยา บนเขากระโดงยังมีโบราณสถานสมัยขอมที่สำคัญ คือ รอยพระพุทธบาทจำลอง และพระพุทธรูปขนาดใหญ่ ชื่อว่า พระสุภัทรบพิตร พระพุทธรูปองค์ใหญ่คู่เมืองบุรีรัมย์ ประดิษฐานอยู่บนยอดเขา ซึ่งเป็นที่เคารพสักการะของคนในท้องถิ่นอีกด้วยนอกจากนี้ ยังมี สะพานพิสูจน์ศรัทธาสาธุชน หรือ บันไดนาคราช ซึ่งสร้างขึ้นเมื่อปี 2512 เพื่อเป็นทางเดินขึ้นไปสักการะบูชาพระสุภัทรบพิตรซึ่งตั้งอยู่บนยอดเขากระโดง จำนวน 297 ขั้น ทำให้เกิดงานประเพณีขึ้นเขากระโดง ในวันขึ้น 15 ค่ำ เดือน 5 ของทุกปี และร่วมทำบูญงานประกวดกวนข้าวทิพย์–ตักบาตรรเทโวโรหณะ ในช่วงก่อนวันออกพรรษาและวันออกพรรษาอีกด้วย',
    imginfo: 'assets/images/4-1.jpg',
    imginfo2: 'assets/images/4-2.jpg',
    imginfo3: 'assets/images/4-3.jpg',
  ),
  Destination(
    imageUrl: 'assets/images/5.jpg',
    city: 'ถนนคนเดินเซราะกราว',
    country: 'เมือง',
    description:
        'เป็นแหล่งช้อปปิ้งที่มีสินค้าหลากหลายประเภท ทั้งเสื้อผ้า ผลิตภัณฑ์โอท็อป',
    info:
        'ถนนคนเดิน เซราะกราว วอล์คกิ้ง สตรีท เป็นแหล่งช้อปปิ้งที่มีสินค้าหลากหลายประเภท ทั้งเสื้อผ้า ผลิตภัณฑ์โอท็อปต่างๆ อาหารคาวหวาน ผักผลไม้จากกลุ่มตลาดนัดสีเขียว สินค้าหัตถกรรมจากชุมชนจากหลายอำเภอมารวมไว้ในที่เดียวนอกจากนี้ยังมีการแสดงดนตรี ศิลปวัฒนธรรมต่างๆ หมุนเวียนผลัดเปลี่ยนกันมาแสดงบนเวทีอยู่เป็นประจำ ทำให้ที่นี่มีสีสัน และคึกคักมากทีเดียว โดยถนนคนเดินจะมีในทุกวันหยุดเสาร์-อาทิตย์ หรือวันหยุดนักขัตฤกษ์ต่างๆ',
    imginfo: 'assets/images/5-1.jpg',
    imginfo2: 'assets/images/5-2.jpg',
    imginfo3: 'assets/images/5-3.jpeg',
  ),
  Destination(
    imageUrl: 'assets/images/6.jpg',
    city: 'สวนนก',
    country: 'สะแกชำ',
    description: 'สถานที่พักผ่อนหย่อนใจ เหมาะสำหรับเที่ยวชมฝูงนกในยามเย็น',
    info:
        'ตั้งอยู่ตำบลสะแกซำ อยู่ในบริเวณอ่างเก็บน้ำห้วยตลาด นักท่องเที่ยวจะได้พบเห็นฝูงนกชนิดต่าง ๆ กว่า 100 ชนิดที่บินมาอาศัย โดยเฉพาะในช่วงฤดูแล้งตั้งแต่เดือนพฤศจิกายน-เมษายน จะมีฝูงนกมาอาศัยอยู่มากเป็นพิเศษ บางชนิดใกล้สูญพันธุ์และหาดูได้ยาก เช่น นกเป็ดหงส์ นกเป็ดก่า และนกกาบบัว เป็นต้น ถ้าหากว่าคุณเป็นคนที่ชื่นชอบธรรมชาติ ชอบที่จะดูนกเพลิน ๆ เคล้ากับบรรยากาศดี ๆ ที่นี่เหมาะสำหรับเป็นที่เที่ยวที่น่าสนใจมากๆ อีกที่หนึ่ง',
    imginfo: 'assets/images/6-1.jpg',
    imginfo2: 'assets/images/6-2.jpg',
    imginfo3: 'assets/images/6-3.jpg',
  ),
  Destination(
    imageUrl: 'assets/images/7.jpg',
    city: 'เขื่อนลำนางรอง',
    country: 'นางรอง',
    description: 'เขื่อนลำนางรอง เป็นเขื่อนดินฐานคอนกรีตขนาดใหญ่',
    info:
        'เขื่อนลำนางรอง เป็นเขื่อนดินฐานคอนกรีตขนาดใหญ่ ซึ่งนอกจากจะกักเก็บน้ำไว้ใช้เพื่อการเกษตรแล้ว ยังเป็นสถานที่ท่องเที่ยวอีกหนึ่งของบุรีรัมย์ที่ชิลสุดๆ ที่นี่ได้รับการขนานนามว่าเป็น “ทะเลสาบแห่งอีสานใต้” เลยทีเดียว เพราะจะมีทะเลสาบเหนือเขื่อนกว้างใหญ่ และสวยงาม มีหาดทรายเทียมให้ลงเล่นน้ำ มีซุ้มนั่งชมวิวริมหาด และมีร้านอาหารหลายร้านให้ได้อร่อยกัน พร้อมเมนูเด็ดปลาสดจากเขื่อน และอาหารพื้นเมืองของอีสานสุดแซ่บ',
    imginfo: 'assets/images/7-1.jpg',
    imginfo2: 'assets/images/7-2.jpg',
    imginfo3: 'assets/images/7-3.jpg',
  ),
  Destination(
    imageUrl: 'assets/images/8.jpg',
    city: 'ปลายนาคาเฟ่',
    country: 'กระสัง',
    description:
        'ปลายนา คาเฟ่ กระสัง อีกหนึ่งที่ชิล ควรแก่การไปเช็คอินนั่งจิบกาแฟเพลินๆ ',
    info:
        'ปลายนา คาเฟ่ กระสัง อีกหนึ่งที่ชิล ควรแก่การไปเช็คอินนั่งจิบกาแฟเพลินๆ ท่ามกลางธรรมชาติสุดแสนจะร่มรื่นในอำเภอกระสัง จังหวัดบุรีรัมย์ ที่นี่จะรายล้อมไปด้วยนาข้าวสีเขียวขจี เห็นแล้วสดชื่นสบายตามากๆ ตัวร้านตกแต่งในสไตล์โมเดิร์นลอฟท์ พร้อมเสิร์ฟเมนูอร่อยมากมาย ยังไงวันหยุดนี้ก็ลองแวะไปชิลได้',
    imginfo: 'assets/images/8-1.jpg',
    imginfo2: 'assets/images/8-2.jpg',
    imginfo3: 'assets/images/8-3.jpg',
  ),
  Destination(
    imageUrl: 'assets/images/9.jpg',
    city: 'สวนคุณปู่ บุรีรัมย์',
    country: 'เมือง',
    description:
        'สวนคุณปู่ บุรีรัมย์ คาเฟ่สุดชิลในบุรีรัมย์ ที่รายล้อมด้วยธรรมชาติ ',
    info:
        'สวนคุณปู่ บุรีรัมย์ คาเฟ่สุดชิลในบุรีรัมย์ ที่รายล้อมด้วยธรรมชาติ นอกจากการมานั่งชิลจิบกาแฟ แลฝูงควายแล้ว ที่นี่ยังมีไฮไลท์เป็นนาข้าวสีเขียวขจี และสะพานที่ทอดยาวเข้าไปในนาข้าว ทำให้เป็นแหล่งพักผ่อนหย่อนใจ และได้ฟีล เดินถ่ายรูปสวยๆ อีกด้วย',
    imginfo: 'assets/images/9-1.jpg',
    imginfo2: 'assets/images/9-2.jpg',
    imginfo3: 'assets/images/9-3.jpg',
  ),
  Destination(
    imageUrl: 'assets/images/10.jpg',
    city: 'เพ-ลา เพลิน',
    country: 'เมือง',
    description: 'เป็นทั้งแหล่งเรียนรู้สำหรับเด็กๆ และบุคคลทั่วไป ',
    info:
        'อุทยานไม้ดอกเพลาเพลิน หรือ เพลาเพลิน เป็นอีกที่เที่ยวหนึ่งในบุรีรัมย์ที่น่าสนใจมากๆ เพราะที่นี่เป็นทั้งแหล่งเรียนรู้สำหรับเด็กๆ และบุคคลทั่วไป รวมถึงยังเป็นที่เที่ยวให้เราได้ไปเดินชิล ถ่ายรูปสวยๆ กับ อุทยานไม้ดอก และเรือนจัดแสดงพืชพันธุ์นานาชนิดไฮไลท์ของที่นี่จะอยู่ที่เรือนกระจก ซึ่งจะจัดแสดงพันธุ์ไม้ตามฤดูกาล โดยเฉพาะช่วงหน้าหนาวที่จะมีทั้ง ดอกทิวลิปสวยๆ หลากหลายสีสันชรวมถึงดอกลิลลี่สีขาวสวย เรียกได้ว่ามาทุกฤดู ได้ชมดอกไม้ไม่เหมือนกันสักฤดูเลยค่ะ นอกจากนี้ก็ยังมีการจัดแสดงพันธุ์ไม้ในโซนอื่นๆ อีกมากมาย ทั้ง เฟิร์นพันธุ์ต่างๆ พืชทะเลทราย และอื่นๆ',
    imginfo: 'assets/images/10-1.jpg',
    imginfo2: 'assets/images/10-2.jpg',
    imginfo3: 'assets/images/10-3.jpg',
  ),
  Destination(
    imageUrl: 'assets/images/11.jpg',
    city: 'จุดชมวิวผาแดง',
    country: 'กระสัง',
    description:
        'จุดชมวิวผาแดง เป็นแหล่งท่องเที่ยวทางธรรมชาติแห่งใหม่ของจังหวัดบุรีรัมย์ ',
    info:
        'จุดชมวิวผาแดง เป็นแหล่งท่องเที่ยวทางธรรมชาติแห่งใหม่ของจังหวัดบุรีรัมย์ ตั้งอยู่ในเขตป่าสงวนแห่งชาติดงใหญ่ เป็นจุดชมวิวที่สวยงามมาก ในช่วงพระอาทิตย์ตก นักท่องเที่ยวจะได้เห็นแสงสุดท้ายของวันที่ลาลับไปพร้อมกับผืนป่า และสัมผัสอากาศบริสุทธิ์ นอกจากนี้ในช่วงฤดูหนาวช่วงเดือนพฤศจิกายนถึงกุมภาพันธ์ อาจจะได้พบกับทะเลหมอกที่สวยงาม ปกคลุมป่าดงใหญ่ และเทือกเขาบรรทัด',
    imginfo: 'assets/images/11-1.jpg',
    imginfo2: 'assets/images/11-2.jpg',
    imginfo3: 'assets/images/11-3.jpg',
  ),
  Destination(
    imageUrl: 'assets/images/12.jpg',
    city: 'หาดปราสาททอง',
    country: 'หนองกี่',
    description:
        'ตั้งอยู่ที่อำเภอหนองกี่ เพิ่งเปิดเป็นแหล่งท่องเที่ยวไปเมื่อช่วงเดือนมกราคม 2559  ',
    info:
        'ตั้งอยู่ที่อำเภอหนองกี่ เพิ่งเปิดเป็นแหล่งท่องเที่ยวไปเมื่อช่วงเดือนมกราคม 2559 เป็นอีกหนึ่งที่เที่ยวพักผ่อนของชาวจังหวัดบุรีรัมย์ บรรยากาศร่มรื่นด้วยแนวต้นไม้ริมหาด รวมถึงยังมีทางเดินริมหาดเอาไว้ให้คุณนั่งเล่นเดินเล่นแบบชิล ๆ ส่วนใหญ่แล้วที่นี่จะคึกคักในช่วงวันหยุด เพราะครอบครัวจะพากันจูงมือลูกหลานมาเที่ยว มาเล่นน้ำ ถือเป็นอีกหนึ่งที่เที่ยวแลนด์มาร์กบุรีรัมย์ที่น่าสนใจอยู่ไม่น้อย',
    imginfo: 'assets/images/12-1.jpg',
    imginfo2: 'assets/images/12-2.jfif',
    imginfo3: 'assets/images/12-3.jfif',
  ),
  Destination(
    imageUrl: 'assets/images/14.jpg',
    city: 'วัดป่าเขาน้อย ',
    country: 'บ้านด่าน',
    description: 'วัดป่าเขาน้อย ตั้งอยู่ติดเขตวนอุทยานภูเขาไฟกระโดง',
    info:
        'วัดป่าเขาน้อย ตั้งอยู่ติดเขตวนอุทยานภูเขาไฟกระโดง เป็นป่าธรรมชาติร่มรื่น และเป็นสถานที่ปฏิบัติธรรมที่สงบเงียบ ภายในวัดป่าเขาน้อยมี พระบรมธาตุเจดีย์ศรีสุวจคุณานุสรณ์ ซึ่งสร้างขึ้นจากแรงเคารพศรัทธาของศิษยานุศิษย์ของหลวงปู่สุวัจน์ สุวโจ เพื่อเป็นที่ประดิษฐานพระบรมสารีริกฐธาตุ และเป็นเครื่องระลึกถึงพระคุณแห่งหลวงปู่สุวัจน์ สุวโจ พระสายธรรมยุติและเป็นลูกศิษย์หลวงปู่มั่น',
    imginfo: 'assets/images/14-1.jpg',
    imginfo2: 'assets/images/14-2.jpeg',
    imginfo3: 'assets/images/14-3.jfif',
  ),
  Destination(
    imageUrl: 'assets/images/15.jpg',
    city: 'วัดเขาอังคาร ',
    country: 'บ้านด่าน',
    description: 'วัดเขาอังคาร หรือ วัดเขาพระอังคาร ตั้งอยู่บนยอดเขาอังคาร',
    info:
        'วัดเขาอังคาร หรือ วัดเขาพระอังคาร ตั้งอยู่บนยอดเขาอังคาร บริเวณที่ตั้งวัดเป็นปากปล่องภูเขาไฟที่ดับแล้ว สันนิษฐานว่าน่าจะเป็นที่ตั้งของโบราณสถานสมัยทวารวดี เพราะพบเสมาหินแกะสลักเป็นจำนวนมาก วัดเขาอังคารเป็นสถาปัตยกรรมแบบวัดพุทธศิลป์ผสมศิลปะขอม ซึ่งเป็นแนวเดียวกันกับปราสาทหินเขาพนมรุ้ง จึงสันนิษฐานว่าอาจจะสร้างมาในสมัยเดียวกับปราสาทหินพนมรุ้ง หรือในยุคที่ขอมเรืองอำนาจภายในวัดมีสิ่งที่น่าสนใจมากมาย เช่น โบสถ์ 3 ยอด ภาพจิตรกรรมฝาผนังเรื่องราวพุทธชาดกเป็นภาษาอังกฤษในโบสถ์ ใบเสมาพันปี พระพิฆเนศงาเดียว พระพุทธ 109 องค์ พระตำหนักศักดิ์สิทธิ์ และเทวรูปเจ้าเมืองขอม เป็นต้น',
    imginfo: 'assets/images/15-1.jpg',
    imginfo2: 'assets/images/15-2.jpg',
    imginfo3: 'assets/images/15-3.jpg',
  ),
];
